Evaluations/adaptivePerf_TPDS_revision/data/output_2025_Oct_10_0537.txt
Running 20m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  8 threads and 100 connections

  Thread calibration: mean lat.: 3211.241ms, rate sampling interval: 10649ms
  Thread calibration: mean lat.: 3247.522ms, rate sampling interval: 11345ms
  Thread calibration: mean lat.: 3125.767ms, rate sampling interval: 9445ms
  Thread calibration: mean lat.: 3490.833ms, rate sampling interval: 11034ms
  Thread calibration: mean lat.: 3034.996ms, rate sampling interval: 10731ms
  Thread calibration: mean lat.: 3663.803ms, rate sampling interval: 11083ms
  Thread calibration: mean lat.: 3050.867ms, rate sampling interval: 11239ms
  Thread calibration: mean lat.: 2872.480ms, rate sampling interval: 10977ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   180.25ms  286.01ms   1.19s    93.25%
    Req/Sec     5.51      0.81     7.00     99.41%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  150.14ms
 75.000%  157.82ms
 90.000%  394.24ms
 99.000%    1.19s 
 99.900%    3.64s 
 99.990%    6.48s 
 99.999%    6.67s 
100.000%    6.67s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.899     0.000000            1         1.00
      10.551     0.100000         3326         1.11
      11.839     0.200000         6645         1.25
      13.607     0.300000         9974         1.43
     148.735     0.400000        13399         1.67
     150.143     0.500000        16953         2.00
     150.655     0.550000        18722         2.22
     151.039     0.600000        19997         2.50
     151.679     0.650000        21713         2.86
     152.575     0.700000        23347         3.33
     157.823     0.750000        24917         4.00
     184.191     0.775000        25750         4.44
     222.847     0.800000        26579         5.00
     390.399     0.825000        27425         5.71
     392.447     0.850000        28305         6.67
     393.471     0.875000        29317         8.00
     393.727     0.887500        29539         8.89
     394.239     0.900000        29909        10.00
     395.519     0.912500        30352        11.43
     427.007     0.925000        30731        13.33
     508.159     0.937500        31147        16.00
     549.375     0.943750        31354        17.78
     590.847     0.950000        31561        20.00
     633.855     0.956250        31769        22.86
     687.615     0.962500        31977        26.67
     743.423     0.968750        32185        32.00
     769.535     0.971875        32290        35.56
     800.255     0.975000        32392        40.00
     849.407     0.978125        32499        45.71
     902.143     0.981250        32600        53.33
     989.183     0.984375        32703        64.00
    1041.407     0.985938        32756        71.11
    1088.511     0.987500        32807        80.00
    1154.047     0.989062        32860        91.43
    1216.511     0.990625        32911       106.67
    1341.439     0.992188        32963       128.00
    1418.239     0.992969        32990       142.22
    1484.799     0.993750        33015       160.00
    1573.887     0.994531        33041       182.86
    1711.103     0.995313        33067       213.33
    1837.055     0.996094        33093       256.00
    1928.191     0.996484        33106       284.44
    2038.783     0.996875        33119       320.00
    2089.983     0.997266        33132       365.71
    2228.223     0.997656        33145       426.67
    2439.167     0.998047        33158       512.00
    2551.807     0.998242        33164       568.89
    2861.055     0.998437        33171       640.00
    3139.583     0.998633        33177       731.43
    3338.239     0.998828        33184       853.33
    3641.343     0.999023        33190      1024.00
    3749.887     0.999121        33193      1137.78
    3995.647     0.999219        33197      1280.00
    4108.287     0.999316        33200      1462.86
    4411.391     0.999414        33203      1706.67
    4628.479     0.999512        33206      2048.00
    4694.015     0.999561        33208      2275.56
    4902.911     0.999609        33210      2560.00
    5206.015     0.999658        33211      2925.71
    5550.079     0.999707        33213      3413.33
    5562.367     0.999756        33214      4096.00
    5812.223     0.999780        33215      4551.11
    5857.279     0.999805        33216      5120.00
    6176.767     0.999829        33217      5851.43
    6316.031     0.999854        33218      6826.67
    6316.031     0.999878        33218      8192.00
    6483.967     0.999890        33219      9102.22
    6483.967     0.999902        33219     10240.00
    6492.159     0.999915        33220     11702.86
    6492.159     0.999927        33220     13653.33
    6492.159     0.999939        33220     16384.00
    6602.751     0.999945        33221     18204.44
    6602.751     0.999951        33221     20480.00
    6602.751     0.999957        33221     23405.71
    6602.751     0.999963        33221     27306.67
    6602.751     0.999969        33221     32768.00
    6672.383     0.999973        33222     36408.89
    6672.383     1.000000        33222          inf
#[Mean    =      180.254, StdDeviation   =      286.012]
#[Max     =     6668.288, Total count    =        33222]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  33616 requests in 11.70m, 9.60MB read
  Socket errors: connect 0, read 0, write 0, timeout 12418
Requests/sec:     47.88  
Transfer/sec:     14.00KB