Evaluations/adaptivePerf_TPDS_revision/data/output_2025_Oct_10_0551.txt
Running 20m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  8 threads and 100 connections

  Thread calibration: mean lat.: 24.978ms, rate sampling interval: 32ms
  Thread calibration: mean lat.: 65.593ms, rate sampling interval: 184ms
  Thread calibration: mean lat.: 75.069ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 340.027ms, rate sampling interval: 1101ms
  Thread calibration: mean lat.: 35.010ms, rate sampling interval: 33ms
  Thread calibration: mean lat.: 130.012ms, rate sampling interval: 957ms
  Thread calibration: mean lat.: 31.927ms, rate sampling interval: 33ms
  Thread calibration: mean lat.: 317.364ms, rate sampling interval: 1221ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   224.96ms  182.84ms 795.65ms   66.72%
    Req/Sec     5.99     12.85    60.00     82.32%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  232.06ms
 75.000%  398.59ms
 90.000%  402.69ms
 99.000%  795.65ms
 99.900%    1.17s 
 99.990%    1.50s 
 99.999%    1.63s 
100.000%    1.63s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.751     0.000000            1         1.00
      11.015     0.100000         5700         1.11
      13.591     0.200000        11390         1.25
     150.271     0.300000        17385         1.43
     151.935     0.400000        22816         1.67
     232.063     0.500000        28527         2.00
     233.215     0.550000        31344         2.22
     234.111     0.600000        34348         2.50
     235.135     0.650000        37008         2.86
     260.607     0.700000        39825         3.33
     398.591     0.750000        42865         4.00
     399.359     0.775000        44619         4.44
     399.871     0.800000        46214         5.00
     400.127     0.825000        46968         5.71
     400.639     0.850000        48408         6.67
     401.407     0.875000        50066         8.00
     401.919     0.887500        50713         8.89
     402.687     0.900000        51323        10.00
     406.527     0.912500        51914        11.43
     442.623     0.925000        52625        13.33
     482.815     0.937500        53339        16.00
     515.839     0.943750        53690        17.78
     542.207     0.950000        54059        20.00
     561.663     0.956250        54407        22.86
     594.431     0.962500        54757        26.67
     629.247     0.968750        55117        32.00
     648.703     0.971875        55290        35.56
     669.183     0.975000        55468        40.00
     694.271     0.978125        55647        45.71
     718.847     0.981250        55824        53.33
     749.055     0.984375        56002        64.00
     761.855     0.985938        56091        71.11
     774.143     0.987500        56179        80.00
     787.967     0.989062        56271        91.43
     800.255     0.990625        56358       106.67
     836.607     0.992188        56446       128.00
     856.063     0.992969        56491       142.22
     880.127     0.993750        56535       160.00
     904.191     0.994531        56579       182.86
     929.279     0.995313        56625       213.33
     963.071     0.996094        56668       256.00
     980.991     0.996484        56690       284.44
     995.839     0.996875        56713       320.00
    1014.271     0.997266        56736       365.71
    1037.823     0.997656        56757       426.67
    1061.887     0.998047        56780       512.00
    1077.247     0.998242        56792       568.89
    1091.583     0.998437        56802       640.00
    1108.991     0.998633        56813       731.43
    1127.423     0.998828        56825       853.33
    1172.479     0.999023        56835      1024.00
    1187.839     0.999121        56840      1137.78
    1197.055     0.999219        56846      1280.00
    1205.247     0.999316        56852      1462.86
    1216.511     0.999414        56857      1706.67
    1248.255     0.999512        56863      2048.00
    1258.495     0.999561        56865      2275.56
    1268.735     0.999609        56868      2560.00
    1319.935     0.999658        56871      2925.71
    1345.535     0.999707        56874      3413.33
    1368.063     0.999756        56877      4096.00
    1373.183     0.999780        56878      4551.11
    1410.047     0.999805        56879      5120.00
    1437.695     0.999829        56881      5851.43
    1439.743     0.999854        56882      6826.67
    1498.111     0.999878        56884      8192.00
    1498.111     0.999890        56884      9102.22
    1503.231     0.999902        56885     10240.00
    1527.807     0.999915        56886     11702.86
    1527.807     0.999927        56886     13653.33
    1541.119     0.999939        56887     16384.00
    1541.119     0.999945        56887     18204.44
    1558.527     0.999951        56888     20480.00
    1558.527     0.999957        56888     23405.71
    1558.527     0.999963        56888     27306.67
    1625.087     0.999969        56889     32768.00
    1625.087     0.999973        56889     36408.89
    1625.087     0.999976        56889     40960.00
    1625.087     0.999979        56889     46811.43
    1625.087     0.999982        56889     54613.33
    1627.135     0.999985        56890     65536.00
    1627.135     1.000000        56890          inf
#[Mean    =      224.955, StdDeviation   =      182.845]
#[Max     =     1626.112, Total count    =        56890]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  57417 requests in 20.00m, 16.41MB read
  Socket errors: connect 0, read 0, write 0, timeout 21217
Requests/sec:     47.84  
Transfer/sec:     14.00KB